app/Controllers/Shopping.php

    public function index($status)
    {
        $shopping = new ShoppingModel;
        $itemsList = new ItemsListModel;
        $stuff = new StuffModel;
        $shop = new ShopModel;
        $data["shops"] = $shop->findAll();
---
SELECT *
FROM `shop`