app/Models/BoxModel.php

SELECT `shop`.`shop_name`, `stuff`.`stuff_name`, `stuff`.`price`, `stuff`.`id_stuff`, `stuff`.`size`, `box`.`create_date`, MONTH(box.create_date) as 'Estd. MONTH', `category`.`category_name`, COUNT(stuff.id_stuff) AS jumlah
FROM `box`
LEFT JOIN `stuff` ON `stuff`.`id_stuff` = `box`.`id_stuff`
LEFT JOIN `category` ON `category`.`id_category` = `stuff`.`id_category`
LEFT JOIN `shop` ON `shop`.`id_shop` = `stuff`.`id_shop`
WHERE `box`.`status` = 'active'
AND MONTH(box.create_date) = '1'
GROUP BY `stuff`.`id_stuff`
---
    public function getData($month)
    {
        $builder = $this->db->table("box");
        $selectColumn = [
            "shop.shop_name",
            "stuff.stuff_name",
            "stuff.price",
            "stuff.id_stuff",
            "stuff.size",
            "box.create_date",
            "MONTH(box.create_date) as 'Estd. MONTH'",
            "category.category_name",
            "COUNT(stuff.id_stuff) AS jumlah"
        ];
        if ($month) {
            $query = $builder->select(
                join(",", $selectColumn)
            )
                ->join("stuff", "stuff.id_stuff = box.id_stuff", "left")
                ->join("category", "category.id_category = stuff.id_category", "left")
                ->join("shop", "shop.id_shop = stuff.id_shop", "left")
                ->where("box.status", "active")
                ->where("MONTH(box.create_date)", $month)
                ->groupBy('stuff.id_stuff')
                ->get()->getResultArray();