app/Models/ShopModel.php

SELECT *
FROM `shop`
---
    public function getShop()
    {
        return $this->findAll();